In [40]:
import pandas as pd

In [41]:
df = pd.read_csv('Used_Bikes.csv')
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [42]:
#data preprocssing --->> ml
# 1 missing value not present 
#2 all columns must be in numerical form
#3 praticular format

In [43]:
df.isnull().sum()

bike_name     0
price         0
city          0
kms_driven    0
owner         0
age           0
power         0
brand         0
dtype: int64

In [44]:
df.duplicated().sum()

25324

In [45]:
df.drop_duplicates(inplace= True)

In [46]:
df.shape

(7324, 8)

In [47]:
df.dtypes

bike_name      object
price         float64
city           object
kms_driven    float64
owner          object
age           float64
power         float64
brand          object
dtype: object

In [48]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,25000.0,Delhi,48587.0,First Owner,8.0,150.0,Hero
9369,Bajaj Avenger 220cc,35000.0,Bangalore,60000.0,First Owner,9.0,220.0,Bajaj
9370,Harley-Davidson Street 750 ABS,450000.0,Jodhpur,3430.0,First Owner,4.0,750.0,Harley-Davidson
9371,Bajaj Dominar 400 ABS,139000.0,Hyderabad,21300.0,First Owner,4.0,400.0,Bajaj
9372,Bajaj Avenger Street 220,80000.0,Hyderabad,7127.0,First Owner,5.0,220.0,Bajaj

In [49]:
cat_col = df.select_dtypes(include="O")
cat_col.head()

                              bike_name       city        owner          brand
0    TVS Star City Plus Dual Tone 110cc  Ahmedabad  First Owner            TVS
1           Royal Enfield Classic 350cc      Delhi  First Owner  Royal Enfield
2                  Triumph Daytona 675R      Delhi  First Owner        Triumph
3                  TVS Apache RTR 180cc  Bangalore  First Owner            TVS
4  Yamaha FZ S V 2.0 150cc-Ltd. Edition  Bangalore  First Owner         Yamaha

In [50]:
num_col = df.select_dtypes(exclude="O")
num_col.head()

      price  kms_driven  age  power
0   35000.0     17654.0  3.0  110.0
1  119900.0     11000.0  4.0  350.0
2  600000.0       110.0  8.0  675.0
3   65000.0     16329.0  4.0  180.0
4   80000.0     10000.0  3.0  150.0

In [51]:

# df['bike_name'].nunique()

In [52]:
cat_col = cat_col.drop(['bike_name','city'],axis=1)
cat_col

            owner            brand
0     First Owner              TVS
1     First Owner    Royal Enfield
2     First Owner          Triumph
3     First Owner              TVS
4     First Owner           Yamaha
...           ...              ...
9362  First Owner             Hero
9369  First Owner            Bajaj
9370  First Owner  Harley-Davidson
9371  First Owner            Bajaj
9372  First Owner            Bajaj

[7324 rows x 2 columns]

In [53]:
cat_col['owner'].value_counts()

First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: owner, dtype: int64

In [54]:
cat_col

            owner            brand
0     First Owner              TVS
1     First Owner    Royal Enfield
2     First Owner          Triumph
3     First Owner              TVS
4     First Owner           Yamaha
...           ...              ...
9362  First Owner             Hero
9369  First Owner            Bajaj
9370  First Owner  Harley-Davidson
9371  First Owner            Bajaj
9372  First Owner            Bajaj

[7324 rows x 2 columns]

In [55]:
dt4 = {"First Owner":1,"Second Owner":2,"Third Owner":3,"Fourth Owner Or More":4}
dt4

{'First Owner': 1,
 'Second Owner': 2,
 'Third Owner': 3,
 'Fourth Owner Or More': 4}

In [56]:
cat_col['owner'].map(dt4)

0       1
1       1
2       1
3       1
4       1
       ..
9362    1
9369    1
9370    1
9371    1
9372    1
Name: owner, Length: 7324, dtype: int64

In [57]:
cat_col['owner'] = cat_col['owner'].map(dt4)
cat_col['owner']

0       1
1       1
2       1
3       1
4       1
       ..
9362    1
9369    1
9370    1
9371    1
9372    1
Name: owner, Length: 7324, dtype: int64

In [58]:
cat_col['brand'].unique()

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

In [59]:
unique_brands = list(cat_col['brand'].unique())
unique_brands

['TVS',
 'Royal Enfield',
 'Triumph',
 'Yamaha',
 'Honda',
 'Hero',
 'Bajaj',
 'Suzuki',
 'Benelli',
 'KTM',
 'Mahindra',
 'Kawasaki',
 'Ducati',
 'Hyosung',
 'Harley-Davidson',
 'Jawa',
 'BMW',
 'Indian',
 'Rajdoot',
 'LML',
 'Yezdi',
 'MV',
 'Ideal']

In [60]:
n = 1
dt5 = {}
for i in cat_col['brand'].unique():
    dt5[i]=n
    n+=1

In [61]:
dt5

{'TVS': 1,
 'Royal Enfield': 2,
 'Triumph': 3,
 'Yamaha': 4,
 'Honda': 5,
 'Hero': 6,
 'Bajaj': 7,
 'Suzuki': 8,
 'Benelli': 9,
 'KTM': 10,
 'Mahindra': 11,
 'Kawasaki': 12,
 'Ducati': 13,
 'Hyosung': 14,
 'Harley-Davidson': 15,
 'Jawa': 16,
 'BMW': 17,
 'Indian': 18,
 'Rajdoot': 19,
 'LML': 20,
 'Yezdi': 21,
 'MV': 22,
 'Ideal': 23}

In [62]:
cat_col['brand'] = cat_col['brand'].map(dt5)
cat_col['brand']

0        1
1        2
2        3
3        1
4        4
        ..
9362     6
9369     7
9370    15
9371     7
9372     7
Name: brand, Length: 7324, dtype: int64

In [63]:
cat_col

      owner  brand
0         1      1
1         1      2
2         1      3
3         1      1
4         1      4
...     ...    ...
9362      1      6
9369      1      7
9370      1     15
9371      1      7
9372      1      7

[7324 rows x 2 columns]

In [64]:
#dt4 and dt5
df2 = pd.concat([cat_col,num_col],axis=1)
df2

      owner  brand     price  kms_driven  age  power
0         1      1   35000.0     17654.0  3.0  110.0
1         1      2  119900.0     11000.0  4.0  350.0
2         1      3  600000.0       110.0  8.0  675.0
3         1      1   65000.0     16329.0  4.0  180.0
4         1      4   80000.0     10000.0  3.0  150.0
...     ...    ...       ...         ...  ...    ...
9362      1      6   25000.0     48587.0  8.0  150.0
9369      1      7   35000.0     60000.0  9.0  220.0
9370      1     15  450000.0      3430.0  4.0  750.0
9371      1      7  139000.0     21300.0  4.0  400.0
9372      1      7   80000.0      7127.0  5.0  220.0

[7324 rows x 6 columns]

In [65]:
df2.isnull().sum()

owner         0
brand         0
price         0
kms_driven    0
age           0
power         0
dtype: int64

In [66]:
x = df2.drop('price',axis='columns')
y = df2[['price']]

In [67]:
# train testing split
from sklearn.model_selection import train_test_split

In [68]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)  #80% train and 20% test

In [69]:
x_train,x_test,y_train,y_test

(      owner  brand  kms_driven   age  power
 6802      1      7      5500.0   3.0  180.0
 4228      1      8     23000.0   6.0  150.0
 5431      1      2     10200.0   5.0  350.0
 3098      1     10      2600.0   2.0  250.0
 5990      1      2     14307.0   5.0  500.0
 ...     ...    ...         ...   ...    ...
 3186      2      4     10784.0   5.0  150.0
 3254      1      2     39301.0   5.0  350.0
 6005      1      1     30000.0   4.0  200.0
 632       1      7     70251.0  13.0  150.0
 1801      1      2     12300.0   6.0  500.0

 [5859 rows x 5 columns],
       owner  brand  kms_driven   age  power
 2522      1     10      1500.0   2.0  390.0
 9234      1      5      9000.0   5.0  110.0
 5136      1      5     30000.0   7.0  150.0
 7316      1      2     19339.0   5.0  350.0
 1287      1     14      2500.0   5.0  650.0
 ...     ...    ...         ...   ...    ...
 3223      1      7      3500.0   6.0  200.0
 5071      2      6     28000.0   6.0  223.0
 3842      1      1     30862.0   5.0  180.0
 1869      2      4     33000.0  10.0  150.0
 4190      1      7     24635.0   5.0  150.0

 [1465 rows x 5 columns],
          price
 6802   70705.0
 4228   55000.0
 5431  125000.0
 3098  190000.0
 5990  145000.0
 ...        ...
 3186  100000.0
 3254   84000.0
 6005   55000.0
 632    28000.0
 1801   90000.0

 [5859 rows x 1 columns],
          price
 2522  260000.0
 9234   46000.0
 5136   36000.0
 7316  103000.0
 1287  350000.0
 ...        ...
 3223   95000.0
 5071   35000.0
 3842   42000.0
 1869   22000.0
 4190   35000.0

 [1465 rows x 1 columns])

In [70]:
#modal  training
# linear regression
#power and price 
from sklearn.linear_model import LinearRegression

In [71]:
lr = LinearRegression()

In [72]:
lr.fit(x_train,y_train)

LinearRegression()

In [73]:
## model evalutaion
lr.score(x_train,y_train)   # trainging data

0.7165320294803188

In [74]:
lr.score(x_test,y_test)

0.7333501680452152

In [75]:
## --------->>>>> model over fit and model under fit ---------------------->>>>>>>>>>>>>
## model score should be above 90%
# traing and testing score not should be more then 5%





#metrics evalutation
    # ( mse----mean squared error 
#     ,mae
#     , score, adjusted  R squared , r squared )

In [76]:
## model over fit 
# traing score high and 
# testing score log      ______________>>>>>>>>>>>>>>>>>>>( overfit condition)

## under fit>
#      traing score ----->>>>>>>  always low
    
#      test score ---------->>>>>>>>> low ya high

In [77]:
prediction = lr.predict(x_test)

# y_test['predict_salary'] = prediction

In [78]:
y_test['predicted_price'] = prediction
y_test

         price  predicted_price
2522  260000.0    239302.080675
9234   46000.0     18785.342785
5136   36000.0     33149.561878
7316  103000.0    129535.490206
1287  350000.0    417054.548594
...        ...              ...
3223   95000.0     86691.997949
5071   35000.0     81209.852262
3842   42000.0     20355.786996
1869   22000.0      5666.596325
4190   35000.0     59248.393734

[1465 rows x 2 columns]

In [79]:
y_test
#with error rate

         price  predicted_price
2522  260000.0    239302.080675
9234   46000.0     18785.342785
5136   36000.0     33149.561878
7316  103000.0    129535.490206
1287  350000.0    417054.548594
...        ...              ...
3223   95000.0     86691.997949
5071   35000.0     81209.852262
3842   42000.0     20355.786996
1869   22000.0      5666.596325
4190   35000.0     59248.393734

[1465 rows x 2 columns]

In [80]:
y_test['diff'] = y_test['price']-y_test['predicted_price']

In [81]:
y_test
#difference----->>> residual

         price  predicted_price          diff
2522  260000.0    239302.080675  20697.919325
9234   46000.0     18785.342785  27214.657215
5136   36000.0     33149.561878   2850.438122
7316  103000.0    129535.490206 -26535.490206
1287  350000.0    417054.548594 -67054.548594
...        ...              ...           ...
3223   95000.0     86691.997949   8308.002051
5071   35000.0     81209.852262 -46209.852262
3842   42000.0     20355.786996  21644.213004
1869   22000.0      5666.596325  16333.403675
4190   35000.0     59248.393734 -24248.393734

[1465 rows x 3 columns]

In [85]:
from sklearn.metrics import mean_squared_error,mean_absolute_error

In [86]:
mean_squared_error(y_test['price'],y_test['predicted_price'])

# mean squred erroe
# should be lower 
# accuracy score down
#

4232362239.6835284

In [89]:
import numpy as np

In [87]:
mean_absolute_error(y_test['price'],y_test['predicted_price'])

# mean absoluted error

33624.411391719455

In [90]:
# root mean squared error
mse = mean_squared_error(y_test['price'],y_test['predicted_price'])
mse

4232362239.6835284

In [91]:
np.sqrt(mse)

65056.60796324635

In [92]:
 from sklearn.metrics import r2_score

In [93]:
r2_score(y_test['price'],y_test['predicted_price'])

0.7333501680452152

In [99]:
(1-0.7333501680452152)*(1465-1)/(1465-5-1)

0.26756364220822815

In [97]:
y_test.shape

(1465, 3)

In [101]:
x_test.shape

(1465, 5)

In [102]:
import joblib ,pickle

In [103]:
ls = ['dalpatbhayal07@gmail.com',"pat@#70dal"]

In [105]:
joblib.dump(ls,'email_id.lb')

['email_id.lb']

In [106]:
ls2 = joblib.load('email_id.lb')
ls2

['dalpatbhayal07@gmail.com', 'pat@#70dal']

In [107]:
joblib.dump(lr,'linear_regression.lb')

['linear_regression.lb']